IS_PUBLIC_MESSAGE = 'Сделать доступной тренировку по этому заголовку всем желающим ' \
                    '(без возможности какого-либо редактирования)'

LABEL_NAME_PLACEHOLDER = 'Название заголовка'
LABEL_NAME_MESSAGE = 'Введите название заголовка ответом на это сообщение (работает один раз)'

CREATE_LABEL_SUCCESS = 'Заголовок успешно создан'

EMPTY_LABELS_LIST = 'У вас пока нет заголовков. Создайте новый!'

EDIT_LABEL_NAME_PLACEHOLDER = 'Новое название заголовка'
EDIT_LABEL_NAME_MESSAGE = 'Введите новое название заголовка ответом на это сообщение (Работает один раз)'
EDIT_LABEL_NAME_SUCCESS = 'Название заголовка изменено'
